In [1]:
! ls

Eric––Project_1_Workbook.ipynb     jmark_working_nb.ipynb
README.md                          lorela_working_nb.ipynb
imdb.title.ratings.csv.gz          unzippedData

In [2]:
! cd unzippedData

In [3]:
! ls

Eric––Project_1_Workbook.ipynb     jmark_working_nb.ipynb
README.md                          lorela_working_nb.ipynb
imdb.title.ratings.csv.gz          unzippedData

In [4]:
! cd /unzippedData

/bin/bash: line 0: cd: /unzippedData: No such file or directory

In [5]:
! ls

Eric––Project_1_Workbook.ipynb     jmark_working_nb.ipynb
README.md                          lorela_working_nb.ipynb
imdb.title.ratings.csv.gz          unzippedData

In [6]:
cd unzippedData

/Users/ericdenbin/Documents/flatiron_ds/phase_1/phase_1_project/lej_project1/unzippedData

In [7]:
! ls

bom.movie_gross.csv       imdb.title.basics.csv     rt.reviews.tsv
imdb.name.basics.csv      imdb.title.principals.csv tmdb.movies.csv
imdb.title.akas.csv       rt.movie_info.tsv         tn.movie_budgets.csv

In [21]:
#Importing pandas

import pandas as pd

#Importing data

name_df = pd.read_csv("imdb.name.basics.csv")

title_akas_df = pd.read_csv("imdb.title.akas.csv")

tmdb_movies_df = pd.read_csv("tmdb.movies.csv")

title_basics_df = pd.read_csv("imdb.title.basics.csv")

title_principals_df = pd.read_csv("imdb.title.principals.csv")

In [25]:
cd ..

/Users/ericdenbin/Documents/flatiron_ds/phase_1/phase_1_project/lej_project1

In [26]:
title_crew_df = pd.read_csv("imdb.title.crew.csv.gz")

In [27]:
title_ratings_df = pd.read_csv("imdb.title.ratings.csv.gz")

In [19]:
name_df.head(10)

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
5,nm0062879,Ruel S. Bayani,NaN,NaN,"director,production_manager,miscellaneous","tt2590280,tt0352080,tt0216559,tt2057445"
6,nm0063198,Bayou,NaN,NaN,actor,"tt6579724,tt0093116"
7,nm0063432,Stevie Be-Zet,NaN,NaN,"composer,soundtrack","tt3106212,tt0478239,tt0264917,tt1626606"
8,nm0063618,Jeff Beal,1963.0,NaN,"composer,music_department,soundtrack","tt0183659,tt2545118,tt0384766,tt1856010"
9,nm0063750,Lindsay Beamish,NaN,NaN,"actress,miscellaneous","tt0404826,tt0111756,tt0367027,tt1492842"

In [30]:
title_basics_df.head(10)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
5,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy
6,tt0112502,Bigfoot,Bigfoot,2017,NaN,"Horror,Thriller"
7,tt0137204,Joe Finds Grace,Joe Finds Grace,2017,83.0,"Adventure,Animation,Comedy"
8,tt0139613,O Silêncio,O Silêncio,2012,NaN,"Documentary,History"
9,tt0144449,Nema aviona za Zagreb,Nema aviona za Zagreb,2012,82.0,Biography

In [34]:
title_principals_df.head(10)

,tconst,ordering,nconst,category,job,characters
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]"
1,tt0111414,2,nm0398271,director,NaN,NaN
2,tt0111414,3,nm3739909,producer,producer,NaN
3,tt0323808,10,nm0059247,editor,NaN,NaN
4,tt0323808,1,nm3579312,actress,NaN,"[""Beth Boothby""]"
5,tt0323808,2,nm2694680,actor,NaN,"[""Steve Thomson""]"
6,tt0323808,3,nm0574615,actor,NaN,"[""Sir Lachlan Morrison""]"
7,tt0323808,4,nm0502652,actress,NaN,"[""Lady Delia Morrison""]"
8,tt0323808,5,nm0362736,director,NaN,NaN
9,tt0323808,6,nm0811056,producer,producer,NaN

In [40]:
title_principals_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   tconst      1028186 non-null  object
 1   ordering    1028186 non-null  int64
 2   nconst      1028186 non-null  object
 3   category    1028186 non-null  object
 4   job         177684 non-null   object
 5   characters  393360 non-null   object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

In [32]:
title_crew_df.head(10)

,tconst,directors,writers
0,tt0285252,nm0899854,nm0899854
1,tt0438973,NaN,"nm0175726,nm1802864"
2,tt0462036,nm1940585,nm1940585
3,tt0835418,nm0151540,"nm0310087,nm0841532"
4,tt0878654,"nm0089502,nm2291498,nm2292011",nm0284943
5,tt0879859,nm2416460,NaN
6,tt0996958,nm2286991,"nm2286991,nm2651190"
7,tt0999913,nm0527109,"nm0527109,nm0329051,nm0001603,nm0930684"
8,tt10003792,nm10539228,nm10539228
9,tt10005130,nm10540239,"nm5482263,nm10540239"

In [33]:
title_ratings_df.head(10)

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21
5   tt1069246            6.2       326
6   tt1094666            7.0      1613
7   tt1130982            6.4       571
8   tt1156528            7.2       265
9   tt1161457            4.2       148

In [35]:
title_basics_df.head(10)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
5,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy
6,tt0112502,Bigfoot,Bigfoot,2017,NaN,"Horror,Thriller"
7,tt0137204,Joe Finds Grace,Joe Finds Grace,2017,83.0,"Adventure,Animation,Comedy"
8,tt0139613,O Silêncio,O Silêncio,2012,NaN,"Documentary,History"
9,tt0144449,Nema aviona za Zagreb,Nema aviona za Zagreb,2012,82.0,Biography

In [44]:
basics_ratings_df = title_basics_df.merge(title_ratings_df, on = 'tconst', how = 'left')
basics_ratings_df.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77.0
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43.0
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517.0
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13.0
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119.0

In [45]:
basics_ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 146144 entries, 0 to 146143
Data columns (total 8 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
 6   averagerating    73856 non-null   float64
 7   numvotes         73856 non-null   float64
dtypes: float64(3), int64(1), object(4)
memory usage: 10.0+ MB

In [51]:
basics_ratings_prin_df = basics_ratings_df.merge(title_principals_df, on='tconst', how='right')

basics_ratings_prin_df.head(10)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,ordering,nconst,category,job,characters
0,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy,NaN,NaN,1,nm0246005,actor,NaN,"[""The Man""]"
1,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy,NaN,NaN,2,nm0398271,director,NaN,NaN
2,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy,NaN,NaN,3,nm3739909,producer,producer,NaN
3,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,10,nm0059247,editor,NaN,NaN
4,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,1,nm3579312,actress,NaN,"[""Beth Boothby""]"

In [53]:
basics_ratings_prin_df.head(10)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,ordering,nconst,category,job,characters
0,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy,NaN,NaN,1,nm0246005,actor,NaN,"[""The Man""]"
1,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy,NaN,NaN,2,nm0398271,director,NaN,NaN
2,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy,NaN,NaN,3,nm3739909,producer,producer,NaN
3,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,10,nm0059247,editor,NaN,NaN
4,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,1,nm3579312,actress,NaN,"[""Beth Boothby""]"
5,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,2,nm2694680,actor,NaN,"[""Steve Thomson""]"
6,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,3,nm0574615,actor,NaN,"[""Sir Lachlan Morrison""]"
7,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,4,nm0502652,actress,NaN,"[""Lady Delia Morrison""]"
8,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,5,nm0362736,director,NaN,NaN
9,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,6,nm0811056,producer,producer,NaN

In [52]:
basics_ratings_prin_df.shape

(1028186, 13)

In [59]:
# Creating a complete df with title basics, title ratings, title principals, and name basics

complete_df = basics_ratings_prin_df.merge(name_df, on='nconst', how='left')
complete_df.head(10)

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy,NaN,NaN,1,nm0246005,actor,NaN,"[""The Man""]",Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064"
1,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy,NaN,NaN,2,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414"
2,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy,NaN,NaN,3,nm3739909,producer,producer,NaN,Barry Porter-Robinson,NaN,NaN,"producer,art_department","tt0290884,tt0101374,tt0111414,tt1566940"
3,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,10,nm0059247,editor,NaN,NaN,Sean Barton,1944.0,NaN,"editor,editorial_department,assistant_director","tt0402910,tt1022883,tt0086190,tt0490181"
4,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,1,nm3579312,actress,NaN,"[""Beth Boothby""]",Brittania Nicol,NaN,NaN,"actress,soundtrack",tt0323808
5,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,2,nm2694680,actor,NaN,"[""Steve Thomson""]",Henry Garrett,NaN,NaN,actor,"tt1441953,tt1790885,tt2639254,tt3839822"
6,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,3,nm0574615,actor,NaN,"[""Sir Lachlan Morrison""]",Graham McTavish,1961.0,NaN,"actor,soundtrack,director","tt0462499,tt0903624,tt1477834,tt1170358"
7,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,4,nm0502652,actress,NaN,"[""Lady Delia Morrison""]",Jacqueline Leonard,1967.0,NaN,actress,"tt0088512,tt0106097,tt0103939,tt0241383"
8,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,5,nm0362736,director,NaN,NaN,Robin Hardy,1929.0,2016.0,"actor,writer,director","tt0070917,tt0097375,tt0091032,tt0323808"
9,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror",3.9,2328.0,6,nm0811056,producer,producer,NaN,Peter Snell,1938.0,NaN,"producer,soundtrack,executive","tt0070917,tt2231097,tt0093771,tt0078836"

In [60]:
complete_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1028186 entries, 0 to 1028185
Data columns (total 18 columns):
 #   Column              Non-Null Count    Dtype
---  ------              --------------    -----
 0   tconst              1028186 non-null  object
 1   primary_title       1028186 non-null  object
 2   original_title      1028186 non-null  object
 3   start_year          1028186 non-null  int64
 4   runtime_minutes     827933 non-null   float64
 5   genres              1006451 non-null  object
 6   averagerating       629755 non-null   float64
 7   numvotes            629755 non-null   float64
 8   ordering            1028186 non-null  int64
 9   nconst              1028186 non-null  object
 10  category            1028186 non-null  object
 11  job                 177684 non-null   object
 12  characters          393360 non-null   object
 13  primary_name        1027912 non-null  object
 14  birth_year          234048 non-null   float64
 15  death_year          11843 non-null    float64
 16  primary_profession  974266 non-null   object
 17  known_for_titles    997445 non-null   object
dtypes: float64(5), int64(2), object(11)
memory usage: 149.0+ MB

In [61]:
complete_df.shape

(1028186, 18)

In [56]:
name_df.shape

(606648, 6)

In [10]:
name_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   nconst              606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
 5   known_for_titles    576444 non-null  object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

In [11]:
name_df.describe()

         birth_year   death_year
count  82736.000000  6783.000000
mean    1967.043826  2000.523367
std       22.122190    43.951530
min        1.000000    17.000000
25%     1957.000000  2001.000000
50%     1971.000000  2013.000000
75%     1981.000000  2016.000000
max     2014.000000  2019.000000

In [ ]:
# Defining top performing movies 
    # highest grossing and highest ROI
    
    # action: clean, filter, analyze this dataset

    # get the list of value counts of top genres (and actors, directors, studios, writers) based on this new dataset created 
        # look back on other (top_critic=1,  i.e. rating >4)
    
    # draw correlations between the top performing movies and genre, directors, studios, writers, actors, ratings
    
    # also looking into movies performing poorly (given enough time)

In [64]:
cd unzippedData

/Users/ericdenbin/Documents/flatiron_ds/phase_1/phase_1_project/lej_project1/unzippedData

In [146]:
movie_budgets_df = pd.read_csv("tn.movie_budgets.csv")

movie_gross_df = pd.read_csv("bom.movie_gross.csv")

In [147]:
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [148]:
# Engineering two new features for the movie budgets dataframe called domestic profit and worldwide profit, 
# which is the production budget subtracted from domestic gross and worldwide gross, respectively

#First we have to clean the columns, removing the dollar sign and commas and creating integers

movie_budgets_df['domestic_gross'] = movie_budgets_df['domestic_gross'].map(lambda x: x[1:])

In [149]:
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","620,181,382","$1,316,721,747"

In [150]:
movie_budgets_df['domestic_gross'] = movie_budgets_df['domestic_gross'].map(lambda x: int(x.replace(",","")))

In [151]:
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000",760507625,"$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000",241063875,"$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000",42762350,"$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000",459005868,"$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000",620181382,"$1,316,721,747"

In [152]:
type(movie_budgets_df['domestic_gross'][1])

numpy.int64

In [153]:
movie_budgets_df['worldwide_gross'] = movie_budgets_df['worldwide_gross'].map(lambda x: int(x[1:].replace(",","")))

In [154]:
type(movie_budgets_df['worldwide_gross'][1])

numpy.int64

In [155]:
movie_budgets_df['production_budget'] = movie_budgets_df['production_budget'].map(lambda x: int(x[1:].replace(",","")))

In [156]:
type(movie_budgets_df['production_budget'][1])

numpy.int64

In [157]:
movie_budgets_df['domestic_profit'] = movie_budgets_df['domestic_gross'] - movie_budgets_df['production_budget']

movie_budgets_df['worldwide_profit'] = movie_budgets_df['worldwide_gross'] - movie_budgets_df['production_budget']

In [158]:
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_profit,worldwide_profit
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,335507625,2351345279
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,-169536125,635063875
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,-307237650,-200237650
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,128405868,1072413963
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,303181382,999721747

In [196]:
movie_budgets_df['domestic_profit_to_budget_ratio'] = movie_budgets_df['domestic_profit']/movie_budgets_df['production_budget']

In [198]:
movie_budgets_df['worldwide_profit_to_budget_ratio'] = movie_budgets_df['worldwide_profit']/movie_budgets_df['production_budget']

In [200]:
movie_budgets_df.head(10)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_profit,worldwide_profit,domestic_profit_to_budget_ratio,worldwide_profit_to_budget_ratio
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,335507625,2351345279,0.789430,5.532577
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,-169536125,635063875,-0.412899,1.546673
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,-307237650,-200237650,-0.877822,-0.572108
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,128405868,1072413963,0.388403,3.243841
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,303181382,999721747,0.956408,3.153696
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,630662225,1747311220,2.060988,5.710167
6,7,"Apr 27, 2018",Avengers: Infinity War,300000000,678815482,2048134200,378815482,1748134200,1.262718,5.827114
7,8,"May 24, 2007",Pirates of the Caribbean: At Worldâs End,300000000,309420425,963420425,9420425,663420425,0.031401,2.211401
8,9,"Nov 17, 2017",Justice League,300000000,229024295,655945209,-70975705,355945209,-0.236586,1.186484
9,10,"Nov 6, 2015",Spectre,300000000,200074175,879620923,-99925825,579620923,-0.333086,1.932070

In [159]:
movie_gross_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [160]:
type(movie_gross_df['domestic_gross'][1])

numpy.float64

In [161]:
type(movie_gross_df['foreign_gross'][1])

str

In [178]:
movie_gross_df['foreign_gross'].replace('1,131.6', '1131600000', inplace=True)

In [179]:
movie_gross_df[movie_gross_df['foreign_gross'] == '1131600000']

                             title studio  domestic_gross foreign_gross  year
1872  Star Wars: The Force Awakens     BV     936700000.0    1131600000  2015

In [181]:
movie_gross_df[movie_gross_df['foreign_gross'] == '1,019.4']

               title studio  domestic_gross foreign_gross  year
1873  Jurassic World   Uni.     652300000.0       1,019.4  2015

In [182]:
movie_gross_df['foreign_gross'].replace('1,019.4', "1019400000", inplace=True)

In [184]:
movie_gross_df[movie_gross_df['foreign_gross'] == '1,163.0']

          title studio  domestic_gross foreign_gross  year
1874  Furious 7   Uni.     353000000.0       1,163.0  2015

In [185]:
movie_gross_df['foreign_gross'].replace('1,163.0', "1163000000", inplace=True)

In [187]:
movie_gross_df['foreign_gross'].replace('1,010.0', "1010000000", inplace=True)

In [189]:
movie_gross_df['foreign_gross'].replace('1,369.5', "1369500000", inplace=True)

In [190]:
movie_gross_df['foreign_gross'] = movie_gross_df['foreign_gross'].map(lambda x: float(x))

In [191]:
movie_gross_df['worldwide_gross'] = movie_gross_df['domestic_gross'] + movie_gross_df['foreign_gross']

In [192]:
movie_gross_df.head()

,title,studio,domestic_gross,foreign_gross,year,worldwide_gross
0,Toy Story 3,BV,415000000.0,652000000.0,2010,1.067000e+09
1,Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010,1.025500e+09
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010,9.603000e+08
3,Inception,WB,292600000.0,535700000.0,2010,8.283000e+08
4,Shrek Forever After,P/DW,238700000.0,513900000.0,2010,7.526000e+08

In [193]:
movie_gross_df = movie_gross_df.drop('worldwide_gross', axis=1)

In [194]:
movie_gross_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000.0,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010
3,Inception,WB,292600000.0,535700000.0,2010
4,Shrek Forever After,P/DW,238700000.0,513900000.0,2010

In [202]:
m_gross_sort_foreign_gross_df = movie_gross_df.sort_values('foreign_gross', ascending = False)

m_gross_sort_foreign_gross_df.head()

                             title studio  domestic_gross  foreign_gross  year
3079        Avengers: Infinity War     BV     678800000.0   1.369500e+09  2018
1874                     Furious 7   Uni.     353000000.0   1.163000e+09  2015
1872  Star Wars: The Force Awakens     BV     936700000.0   1.131600e+09  2015
1873                Jurassic World   Uni.     652300000.0   1.019400e+09  2015
2760       The Fate of the Furious   Uni.     226000000.0   1.010000e+09  2017

In [203]:
m_budgets_sort_worldwide_gross_df = movie_budgets_df.sort_values('worldwide_gross', ascending = False)

In [204]:
m_budgets_sort_worldwide_gross_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_profit,worldwide_profit,domestic_profit_to_budget_ratio,worldwide_profit_to_budget_ratio
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,335507625,2351345279,0.789430,5.532577
42,43,"Dec 19, 1997",Titanic,200000000,659363944,2208208395,459363944,2008208395,2.296820,10.041042
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,630662225,1747311220,2.060988,5.710167
6,7,"Apr 27, 2018",Avengers: Infinity War,300000000,678815482,2048134200,378815482,1748134200,1.262718,5.827114
33,34,"Jun 12, 2015",Jurassic World,215000000,652270625,1648854864,437270625,1433854864,2.033817,6.669092

In [206]:
movie_budgets_df["worldwide_roi"] = movie_budgets_df["worldwide_profit"]/movie_budgets_df["worldwide_gross"]

movie_budgets_df["domestic_roi"] = movie_budgets_df["domestic_profit"]/movie_budgets_df['domestic_gross']

In [207]:
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_profit,worldwide_profit,domestic_profit_to_budget_ratio,worldwide_profit_to_budget_ratio,worldwide_roi,domestic_roi
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,335507625,2351345279,0.789430,5.532577,0.846921,0.441163
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,-169536125,635063875,-0.412899,1.546673,0.607331,-0.703283
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,-307237650,-200237650,-0.877822,-0.572108,-1.337036,-7.184770
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,128405868,1072413963,0.388403,3.243841,0.764364,0.279748
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,303181382,999721747,0.956408,3.153696,0.759251,0.488859

In [211]:
movie_budgets_df.drop("domestic_roi", axis=1, inplace=True)

In [212]:
movie_budgets_df.drop("worldwide_roi", axis=1, inplace=True)

In [213]:
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_profit,worldwide_profit,domestic_profit_to_budget_ratio,worldwide_profit_to_budget_ratio
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,335507625,2351345279,0.789430,5.532577
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,-169536125,635063875,-0.412899,1.546673
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,-307237650,-200237650,-0.877822,-0.572108
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,128405868,1072413963,0.388403,3.243841
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,303181382,999721747,0.956408,3.153696

In [214]:
movie_budgets_df["worldwide_profit_to_rev"] = movie_budgets_df["worldwide_profit"]/movie_budgets_df["worldwide_gross"]

movie_budgets_df["domestic_profit_to_rev"] = movie_budgets_df["domestic_profit"]/movie_budgets_df['domestic_gross']

In [215]:

movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_profit,worldwide_profit,domestic_profit_to_budget_ratio,worldwide_profit_to_budget_ratio,worldwide_profit_to_rev,domestic_profit_to_rev
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,335507625,2351345279,0.789430,5.532577,0.846921,0.441163
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,-169536125,635063875,-0.412899,1.546673,0.607331,-0.703283
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,-307237650,-200237650,-0.877822,-0.572108,-1.337036,-7.184770
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,128405868,1072413963,0.388403,3.243841,0.764364,0.279748
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,303181382,999721747,0.956408,3.153696,0.759251,0.488859